export const categoryData = [
  {
    category: "СОФ",
    correspondingMacrozones: ["Напитки", "Снеки", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Кондитерские изделия",
    correspondingMacrozones: [
      "Напитки",
      "Чай, Кофе",
      "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
      "Мороженое",
      "Молочная продукция",
      "Хлебопродукты",
    ],
  },
  {
    category: "Промо",
    correspondingMacrozones: ["Промо"],
  },
  {
    category: "Мясная гастрономия",
    correspondingMacrozones: ["Бакалея (специи, масло, соусы)", "Консервация", "Снеки", "Напитки", "Кулинария (Food to go)"],
  },
  {
    category: "Молочная продукция",
    correspondingMacrozones: ["Кондитерские изделия", "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)"],
  },
  {
    category: "Сыры",
    correspondingMacrozones: ["Кулинария (Food to go)", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Рыбная продукция",
    correspondingMacrozones: ["Напитки", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Свежее мясо",
    correspondingMacrozones: ["Напитки", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Кулинария (Food to go)",
    correspondingMacrozones: [
      "Напитки",
      "Снеки",
      "Кондитерские изделия",
      "Чай, Кофе",
      "Консервация",
      "Хлебопродукты",
      "ЗОЖ",
      "СОФ",
    ],
  },
  {
    category: "Детское питание",
    correspondingMacrozones: ["Детская гигиена", "Детское питание", "Молочная продукция", "Мороженое", "Кондитерские изделия"],
  },
  {
    category: "Снеки",
    correspondingMacrozones: ["Напитки", "Кулинария (Food to go)", "Консервация", "Бакалея (специи, масло, соусы)", "Снеки"],
  },
  {
    category: "Напитки",
    correspondingMacrozones: [
      "Снеки",
      "Кулинария (Food to go)",
      "Мясная гастрономия",
      "Консервация",
      "Мороженое",
      "Хлебопродукты",
      "Бакалея (мука, крупы, макароны)",
      "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Кондитерские изделия",
      "Молочная продукция",
      "Сыры",
      "Рыбная продукция",
      "Напитки",
    ],
  },
  {
    category: "Бакалея (мука, крупы, макароны)",
    correspondingMacrozones: [
      "Консервация",
      "Бакалея (мука, крупы, макароны)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Мясная гастрономия",
      "Рыбная продукция",
    ],
  },
  {
    category: "Чистящие и моющие средства",
    correspondingMacrozones: ["Товары для дома, текстиль и одежда", "Чистящие и моющие средства", "Косметика и уход за телом"],
  },
  {
    category: "Товары для дома, текстиль и одежда",
    correspondingMacrozones: ["Товары для дома, текстиль и одежда", "Чистящие и моющие средства", "Косметика и уход за телом"],
  },
  {
    category: "Косметика и уход за телом",
    correspondingMacrozones: ["Товары для дома, текстиль и одежда", "Косметика и уход за телом"],
  },
  {
    category: "Яйца",
    correspondingMacrozones: ["Молочная продукция", "Бакалея (мука, крупы, макароны)", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Чай, Кофе",
    correspondingMacrozones: [
      "Кондитерские изделия",
      "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
      "Хлебопродукты",
      "ЗОЖ",
      "Кулинария (Food to go)",
      "Чай, Кофе",
    ],
  },
  {
    category: "Бакалея (специи, масло, соусы)",
    correspondingMacrozones: [
      "Консервация",
      "Бакалея (мука, крупы, макароны)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Мясная гастрономия",
      "Рыбная продукция",
    ],
  },
  {
    category: "Товары для животных",
    correspondingMacrozones: ["Товары для животных"],
  },
  {
    category: "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
    correspondingMacrozones: [
      "Кондитерские изделия",
      "Чай, Кофе",
      "Мороженое",
      "Молочная продукция",
      "Напитки",
      "Хлебопродукты",
      "Кулинария (Food to go)",
    ],
  },
  {
    category: "Замороженные полуфабрикаты",
    correspondingMacrozones: ["Бакалея (специи, масло, соусы)", "Консервация", "Снеки", "Напитки", "Кулинария (Food to go)"],
  },
  {
    category: "ЗОЖ",
    correspondingMacrozones: ["ЗОЖ", "Напитки"],
  },
  {
    category: "Консервация",
    correspondingMacrozones: [
      "Консервация",
      "Бакалея (мука, крупы, макароны)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Мясная гастрономия",
      "Рыбная продукция",
    ],
  },
  {
    category: "Хлебопродукты",
    correspondingMacrozones: [
      "Кулинария (Food to go)",
      "Мясная гастрономия",
      "Консервация",
      "Мороженое",
      "Хлебопродукты",
      "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Кондитерские изделия",
      "Молочная продукция",
      "Сыры",
      "Рыбная продукция",
      "Напитки",
      "Консервация",
    ],
  },
  {
    category: "Детская гигиена",
    correspondingMacrozones: ["Детское питание", "Детская гигиена", "Косметика и уход за телом"],
  },
  {
    category: "Мороженое",
    correspondingMacrozones: [
      "Кондитерские изделия",
      "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
      "Напитки",
      "Снеки",
      "Молочная продукция",
      "Кулинария (Food to go)",
      "Чай, Кофе",
    ],
  },
  {
    category: "Food",
    correspondingMacrozones: ["СТМ", "Распродажа"],
  },
  {
    category: "Non Food",
    correspondingMacrozones: ["СТМ", "Распродажа"],
  },
  {
    category: "Сезон",
    correspondingMacrozones: ["Сезон"],
  },
];

export const getCategories = () => categoryData.map((item) => item.category);

export const getCorrespondingMacrozones = (category: string) => {
  const categoryItem = categoryData.find((item) => item.category === category);
  return categoryItem ? categoryItem.correspondingMacrozones : [];
};
