export const categoryData = [
  {
    category: "Консервация",
    adjacentMacrozones: [
      "Бакалея (мука, крупы, макароны)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Мясная гастрономия",
      "Рыбная продукция",
    ],
  },
  {
    category: "СОФ",
    adjacentMacrozones: ["Напитки", "Снеки", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Замороженные полуфабрикаты",
    adjacentMacrozones: ["Бакалея (специи, масло, соусы)", "Консервация", "Снеки", "Напитки", "Кулинария (Food to go)"],
  },
  {
    category: "Сыры",
    adjacentMacrozones: ["Кулинария (Food to go)", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Хлебопродукты",
    adjacentMacrozones: [
      "Кулинария (Food to go)",
      "Мясная гастрономия",
      "Консервация",
      "Мороженое",
      "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Кондитерские изделия",
      "Молочная продукция",
      "Сыры",
      "Рыбная продукция",
      "Напитки",
    ],
  },
  {
    category: "Рыбная продукция",
    adjacentMacrozones: ["Напитки", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Напитки",
    adjacentMacrozones: [
      "Снеки",
      "Кулинария (Food to go)",
      "Мясная гастрономия",
      "Консервация",
      "Мороженое",
      "Хлебопродукты",
      "Бакалея (мука, крупы, макароны)",
      "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Кондитерские изделия",
      "Молочная продукция",
      "Сыры",
      "Рыбная продукция",
    ],
  },
  {
    category: "Кулинария (Food to go)",
    adjacentMacrozones: [
      "Напитки",
      "Снеки",
      "Кондитерские изделия",
      "Чай, кофе",
      "Консервация",
      "Хлебопродукты",
      "ЗОЖ",
      "СОФ",
    ],
  },
  {
    category: "Мясо и яйца",
    adjacentMacrozones: ["Напитки", "Бакалея (специи, масло, соусы)"],
  },
  {
    category: "Бакалея",
    adjacentMacrozones: [
      "Консервация",
      "Бакалея (мука, крупы, макароны)",
      "Бакалея (специи, масло, соусы)",
      "Замороженные полуфабрикаты",
      "Мясная гастрономия",
      "Рыбная продукция",
    ],
  },
  {
    category: "Шоколадно-конфетные изделия",
    adjacentMacrozones: [
      "Напитки",
      "Чай, Кофе",
      "Бакалея (сахар, джем, мед, сгущенка, сухой завтрак)",
      "Мороженое",
      "Молочная продукция",
      "Хлебопродукция",
    ],
  },
]

export const getCategories = () => categoryData.map((item) => item.category)

export const getAdjacentMacrozones = (category: string) => {
  const categoryItem = categoryData.find((item) => item.category === category)
  return categoryItem ? categoryItem.adjacentMacrozones : []
}

